#            Знайти 5 студентів із найбільшим середнім балом з усіх предметів.
# Знайти студента із найвищим середнім балом з певного предмета.
# Знайти середній бал у групах з певного предмета.
# Знайти середній бал на потоці (по всій таблиці оцінок).
# Знайти які курси читає певний викладач.
# Знайти список студентів у певній групі.
# Знайти оцінки студентів у окремій групі з певного предмета.
# Знайти середній бал, який ставить певний викладач зі своїх предметів.
# Для кожного запиту оформити окремий файл query_number.sql, де замість number підставити номер запиту. Файл містить SQL інструкцію, яку можна виконати як у терміналі бази даних, так і через cursor.execute(sql)

# Додаткове завдання

# Для додаткового завдання зробіть такі запити підвищеної складності:
# Середній бал, який певний викладач ставить певному студентові.
# Оцінки студентів у певній групі з певного предмета на останньому занятті.import sqlite3

